const IMGPATH = "./public/images/services/";
const pdtData = [
    {
        "anchor": "anchor1",
        "anchor_link": "#anchor1",
        "name": "液劑",
        "heading": "化妝水、卸妝水、慕斯",
        "content": "肌膚的狀態會隨著季節變化而有所改變，清爽的液態水劑類產品包含單相、多相體系，配合多種保養品型態，可製作洗顏、卸妝、化妝水、精華液、凝膠、面膜、安瓶、晚安凍膜...等。",
        "pic": `${IMGPATH}pdt1.jpg`
    }
    ,{
        "anchor": "anchor2",
        "anchor_link": "#anchor2",
        "name": "油劑",
        "heading": "按摩油、卸妝油、潤膚油",
        "content": "以液態脂類或脂類混合物所組成。如按摩油、護髮油、嬰兒油、沐浴油、液態護唇膏(唇油)...等，因滑潤質地、密封性較高的特性常用於搭配按摩手法來提升肌表微循環，幫助有效成分的吸收。較寒冷乾燥的氣候環境、容易乾裂粗糙肌膚適用。",
        "pic": `${IMGPATH}pdt1.jpg`
    }

    ,{
        "anchor": "anchor3",
        "anchor_link": "#anchor3",
        "name": "乳劑",
        "heading": "身體乳液、臉部乳液、洗髮乳、護髮乳",
        "content": "常見為O/W(水包油)、跟W/O(油包水)兩類。作為潤膚產品能滋潤肌膚及鎖住水分，質地較為絲滑好推抹、又不似乳霜稠厚。 許多人都害怕使用乳液或霜，總覺得很油，但是當肌膚表面上的天然保護膜受損的時候，還是需要用到含有油脂的保養品來加強保濕。",
        "pic": `${IMGPATH}pdt1.jpg`
    }

    ,{
        "anchor": "anchor4",
        "anchor_link": "#anchor4",
        "name": "膠劑",
        "heading": "凍膜、凝膠、凝露",
        "content": "一種由水溶性大分子保濕成分所構成的凍膠狀保養品，這種凍膠會在皮膚表層形成一層非常緊密貼服的覆蓋層，這層覆蓋層主要作用為形成鎖水層幫助保濕，並幫助覆蓋層下的保養品往皮膚內滲透，加速保養品吸收。",
        "pic": `${IMGPATH}pdt1.jpg`
    }

    ,{
        "anchor": "anchor5",
        "anchor_link": "#anchor5",
        "name": "霜劑",
        "heading": "日霜、晚霜、修護霜、護手乳",
        "content": "屬半固態體系的膏狀產品，包含較為滋養豐厚的霜體、高級乳霜類保養品多在此範疇。在乾燥寒冷的環境，或者乾性肌膚、容易因冷空氣而乾燥敏感的人，就會需要用到含較高油脂的保養品來滋養修復、維護肌膚角質層的健康，而不是選擇清爽無油脂的凝膠類產品。",
        "pic": `${IMGPATH}pdt1.jpg`
    }

    ,{
        "anchor": "anchor6",
        "anchor_link": "#anchor6",
        "name": "面膜",
        "heading": "保濕面膜、美白面膜、控油面膜",
        "content": "運用封閉式傳輸系統，以敷臉或布膜類的形式貼合於臉上或皮膚上，將皮膚與外界隔絕，建立形成半封閉空間，此空間漸漸被皮膚溫度加熱時(皮膚大約可以升高1度)，促使肌膚上的毛細孔會被強迫打開，透過貼布或敷料與肌膚緊密貼合，再利用滲透的原理，讓面膜的精華液可滲入肌膚增加吸收效率。",
        "pic": `${IMGPATH}pdt1.jpg`
    }
    ,{
        "anchor": "anchor7",
        "anchor_link": "#anchor7",
        "name": "精華液",
        "heading": "抗老精華液、美白精華液、除皺精華液、膠原蛋白精華液",
        "content": "精華類產品具有快速滲透的特性，可幫助密集補充肌膚所需養份，於化妝水後使用，有助快速填補角質層的水分，提高後續乳液、乳霜的吸收力。還可以細分為：\n1.精華液：擁有輕盈水潤的質地，多訴求保濕，常見的成分像是：玻尿酸、膠原蛋白、甘油、維生素B5，能快速補充肌膚水分，改善因乾燥引起的敏感、暗沈、細紋等問題膚況。\n2.精華油：成分多萃取自天然植物，如玫瑰果油、絞鯊烷、荷荷葩油、乳木果油等。高品質精華油具有良好的親膚性，能改善缺水狀態，增加肌膚柔軟度、彈性。\n(皮膚大約可以升高1度)，促使肌膚上的毛細孔會被強迫打開，透過貼布或敷料與肌膚緊密貼合，再利用滲透的原理，讓面膜的精華液可滲入肌膚增加吸收效率。",
        "pic": `${IMGPATH}pdt1.jpg`
    }

    ,{
        "anchor": "anchor8",
        "anchor_link": "#anchor8",
        "name": "香氛",
        "heading": "噴霧、擴香、精油",
        "content": "香氛噴霧 : 用來消除異味，並為目標物帶來怡人的香氣，甚至也能依需要達到抗菌的功效。 香氛蠟燭 : 香氛可借由蠟燭融化而散發，或由蠟燭本身釋放出來。 擴香 : 利用慢慢擴散揮發的毛細現象，將香氣擴散漫佈在環境裡。擴香瓶的香氣持久度屬於比較快速、穩定與持久的香氣散佈法，比起蠟燭至少需要燒到半小時之後，才會有香氣，室內擴香的速度是能立即感受到的。",
        "pic": `${IMGPATH}pdt1.jpg`
    }

    ,{
        "anchor": "anchor9",
        "anchor_link": "#anchor9",
        "name": "洗劑",
        "heading": "沐浴精、洗髮精、洗衣精、洗碗精",
        "content": "洗髮精、沐浴乳、潔顏乳、慕絲、卸妝水等產品，主要組成是由水 (相) 和界面活性劑，常見的界活有十二烷基硫酸鈉鹽 (SLS)、十二烷基醚硫酸鈉 (SLES)、甜菜鹼 (Betaine) 、APG等，有些產品中會加入植物賦脂劑或矽靈等作為增加洗後保濕感和滑順感；卸妝水則是利用在水相中加入短碳鏈的界面活性劑來達到清潔的效果；卸妝油則是利用油 (相) 將彩妝溶出之後，再利用界面活性劑將彩妝及油 (相) 帶走。",
        "pic": `${IMGPATH}pdt1.jpg`
    }


];

const app = {
    data() {
        return {
            list: pdtData
        }
    }
}

const OEMPdt = Vue.createApp(app).mount("#OEMPdt");



$(function () {

});